# Aggregate, filter, transform,apply

In [7]:
import pandas as pd
import numpy as np
df=pd.DataFrame({"groups":["A","B","C","A","B","C"],
                "veriable1":[10,23,33,22,11,99],
                "veriable2":[10,253,333,262,111,969]},
               columns=["groups","veriable1","veriable2"])
df

  groups  veriable1  veriable2
0      A         10         10
1      B         23        253
2      C         33        333
3      A         22        262
4      B         11        111
5      C         99        969

In [4]:
# aggregate

In [5]:
df.groupby("groups").mean()

        veriable1  veriable2
groups
A              16        136
B              17        182
C              66        651

In [10]:
df.groupby("groups").aggregate(["min",np.median,max]) # burda "" kullanmak zoruda deÄŸilsin

       veriable1            veriable2
             min median max       min median  max
groups
A             10     16  22        10    136  262
B             11     17  23       111    182  253
C             33     66  99       333    651  969

In [16]:
df.groupby("groups").aggregate({"veriable1":min,"veriable2":max})

        veriable1  veriable2
groups
A              10        262
B              11        253
C              33        969

In [ ]:
# filter

In [17]:
def filter_func(x):
    return x["veriable1"].std()>9

In [19]:
df.groupby("groups").std()

        veriable1   veriable2
groups
A        8.485281  178.190909
B        8.485281  100.409163
C       46.669048  449.719913

In [18]:
df.groupby("groups").filter(filter_func)

  groups  veriable1  veriable2
2      C         33        333
5      C         99        969

In [20]:
# transform

In [21]:
df

  groups  veriable1  veriable2
0      A         10         10
1      B         23        253
2      C         33        333
3      A         22        262
4      B         11        111
5      C         99        969

In [22]:
df["veriable1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: veriable1, dtype: int64

In [34]:
df_a=df.iloc[:,1:3]

In [ ]:
# apply

In [35]:

df=pd.DataFrame({"veriable1":[10,23,33,22,11,99],
                "veriable2":[10,253,333,262,111,969]},
               columns=["veriable1","veriable2"])
df

   veriable1  veriable2
0         10         10
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [36]:
df.apply(np.sum)

veriable1     198
veriable2    1938
dtype: int64

In [37]:
df=pd.DataFrame({"groups":["A","B","C","A","B","C"],
                "veriable1":[10,23,33,22,11,99],
                "veriable2":[10,253,333,262,111,969]},
               columns=["groups","veriable1","veriable2"])
df

  groups  veriable1  veriable2
0      A         10         10
1      B         23        253
2      C         33        333
3      A         22        262
4      B         11        111
5      C         99        969

In [38]:
df.groupby("groups").apply(np.sum)

       groups  veriable1  veriable2
groups
A          AA         32        272
B          BB         34        364
C          CC        132       1302

In [40]:
df.groupby("groups").apply(np.mean)

        veriable1  veriable2
groups
A            16.0      136.0
B            17.0      182.0
C            66.0      651.0